"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.
"""
#--------------------------------------------------------------------------

userName = input('Введите ваше имя: ')
userPassvord = input('Введите ваш пароль: ')
userAge = input('Введите ваш возраст: ')
print(f'Ваши данные для входа в аккаунт: имя - {userName}, пароль - {userPassvord}, возраст - {userAge}')